{"pageProps":{"article":{"title":"Mixwell from G2 Overshadowed Everyone at VCT EU Closed Qualifier","image":"/images/csgo/csgo2.png","id":"mixwell-from-g2-overshadowed-everyone-at-vct-eu-closed-qualifier","categoryId":"news","date":"May 8, 2021","author":"James Fudge","content":"<p>With an impressive final score of 31/11/14, Mixwell’s Viper was a highlight of the match.</p><p>Mixwell (Oscar Colocho) from the European team G2 Esports has shown his versatility and skill, having a highlight of his career after choosing other agent roles in the competitive matches of Valorant.</p><p>As mainly a duelist player, Mixwell was well-known to be among the top Jett users in the scene. However, for the Open Qualifiers for the upcoming VCT EU Stage 3 Challengers, the player has decided to switch things around, focusing on playing sentinels, like Killjoy and Cypher, with occasionally switching to Viper and Skye.</p><h3>Mixwell Performs an Incredible Ace with Viper on Fnatic</h3><p>In the Closed Qualifiers, G2 has met with Fnatic on Bind in the upper bracket.</p><p>Mixwell’s choice of Viper has paid off with an impressive KDA of 31/11/14.</p><p>It has also proven to be a great counter-play to the established Fnatic strategy of steamrolling the opponents with a no-duelist team.</p><p>With the rest of his team attacking B, Mixwell has exploited the utility of the Viper’s ultimate to open the A all to himself.</p><p>Then, he was able to catch the opponents during their rotation, achieving the Ace in the process.</p><p>The match was finished with the clash on Haven, with the fight continuing up till overtime. G2 has finished with a banging round, retaking the site on A and winning the match.</p><h3G2 Esports is Back in the Leading Position in the European Valorant Professional Community></h3G2><p>Since G2 Esports has introduced the new team cast, it had a winning streak up to the Closed Qualifiers.</p><p>During this stage, they’ve managed to overpower such powerhouses as Team Vitality and Fnatic, earning their spot in the Main Event.</p><p>During the Main Event, G2 is scheduled to meet with Team Liquid, Guild Esports, Ascend, and four other teams from the Lower Bracket. Don’t miss the epic battle on July 8!</p>"}},"__N_SSG":true}