{"pageProps":{"article":{"title":"An Agreement Between Astralis Group and POWER is Being Announced","image":"/images/csgo/csgo3.png","id":"an-agreement-between-astralis-group-and-power-is-being-announced","categoryId":"cs-go","date":"May 8, 2021","author":"James Fudge","content":"<p>Astralis Group is a well-known esports company located in Denmark. This deal marks their cooperation with POWER – a chain of retail stores dealing in electronic devices all around Nordic countries.</p><p>The partnership is said to be in effect till late 2022.</p><p>In the press release on the subject, the company mentions that their main goal is to get closer to their target audience – gamers and fans in Nordic countries.</p><p>According to the CRO of Astralis Group, Mr. Kristensen, this is a key move in their strategy to have a bigger presence for their fans. He also mentioned that through the exposure in the POWER locations they expect to reach more gamers that might be interested in what the organization has to offer.</p><p>The beginning stages of the cooperation are expected to begin in the next few months. One of the first steps is said to be the establishment of Astralis Nexus – an entertainment center in the middle of Copenhagen. Through it, the group expects to promote the benefits of gaming overall and esports as a part of it. Astralis wants to engrain themselves in the everyday life of the Nordic gaming community.</p><p>While POWER does not specialize in a particular type of electronics, all locations are said to have PCs, specialized gaming equipment, and even gaming furniture, like chairs.</p><p>POWER stores are present all around the region, with locations in Denmark, Norway, Sweden, and Finland.</p><p>POWER Denmark representative, Mr. Frolich, has expressed excitement over the deal as well. Astralis is almost synonymous with esports in the region, so the partnership will allow for POWER to reach a bigger audience of gamers as well as gain a certain reputation in the community.</p><p>POWER will reportedly provide exclusive branded products to Astralis fans, unique items you won’t be able to find anywhere else and organize certain activities for interested buyers.</p><p>POWER already has a significant presence in the gaming community, as they provide funds and support to the major Counter-Strike league in the region – the POWER League. This move will help them to reach out to consumers on a different level and become an even bigger center of attention.</p><p>Over the recent years, Astralis has partnered with multiple other local companies, which has definitely grown the community around it. This latest major partnership will help the group to more effectively endorse and promote the esports scene, and reach a bigger audience.</p>"}},"__N_SSG":true}