{"pageProps":{"article":{"title":"Cloud9 Overpowers Team Liquid, Solidifying Their Third Place in 2021 LCS Summer Split Week 5","image":"/images/dota/dota1.png","id":"news-4","categoryId":"news","date":"May 8, 2021","author":"James Fudge","content":"<p>C9 and Liquid have been trading third and fourth place, but the fight seems to be over.</p><p>At week 5 of the Summer Split, the teams’ positions in the leaderboard seem to be more definite than they were before.</p><p>The competition between Team Liquid and C9 spans over the whole LCS championship. That’s why the tension on the second day of week five of this split has been palpable. However, this time the battle has been waged not for the champion’s title, but rather for the third and fourth place in the tournament table.</p><p>C9 has made the first step towards their win during the champion selection. Namely, they’ve chosen the comp of Viego, Yone, Kalista, Diana, and Rakan. This way, Liquid could never stay under the protection of the turret. While Liquid has dominated at the beginning of the game thanks to a Trundle pick, the early seed of the C9’s dive comp has been planted.</p><p>The first blood has been achieved during the gank in the top by Fudge, but, almost at the same moment, another kill was achieved. Vulcan has fallen on Jensen in the mid lane, with CC support from Yone and Rakan duo. Just after the dust has settled, Blaber has managed to solo-kill Jenkins just in the span of the first 15 minutes of the match.</p><p>After that, we get to the final part of the game. C9 lacked the vision on the river, but they’ve pushed the side lanes and waited for Liquid to push to the drake. That’s why they were prepared and have met Liquid with the ult from Blaber’s Diana combined with pulling from Kalista. This guaranteed the team the Baron on the 23rd minute, which was the next important step towards the win. Another memorable moment that pushed Liquid towards losing was a bug that prevented Jensen from casting Q and E to get away from the enemy team, which put the game on pause.</p><p>This loss for Liquid marks the final nail in their coffin, dropping them far behind third place at 19-13. With Zven coming back into the game, C9 feels reinvigorated and seems to be doing well with a score of 21-11.</p><p>We will see the teams clash together once again this week, and C9 will later pursue their other opponents in TSM to get a chance of earning second place in the tournament.</p>"}},"__N_SSG":true}